apache/nuttx/arch/arm/src/stm32l4/stm32l4_pulsecount.c
#endif /* CONFIG_STM32L4_TIM8_PULSECOUNT */

static const struct pulsecount_ops_s g_pulsecountops =
{
  .setup       = pulsecount_setup,
  .shutdown    = pulsecount_shutdown,
  .start       = pulsecount_start,
  .stop        = pulsecount_stop,
  .ioctl       = pulsecount_ioctl,
};

#ifdef CONFIG_STM32L4_TIM1_PULSECOUNT
static struct stm32l4_pulsecount_s g_pulsecount1lower =
{
  .ops = &g_pulsecountops,
  .timer = &g_pulsecount1dev,
};
#endif

#ifdef CONFIG_STM32L4_TIM8_PULSECOUNT
static struct stm32l4_pulsecount_s g_pulsecount8lower =
{
  .ops = &g_pulsecountops,
  .timer = &g_pulsecount8dev,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pulsecount_getreg
 *
 * Description:
 *   Read the value of an pulsecount timer register.
 *
 * Input Parameters:
 *   priv - A reference to the pulsecount block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint16_t pulsecount_getreg(struct stm32l4_tim_s *priv, int offset)
{
  return getreg16(priv->base + offset);
}

/****************************************************************************
 * Name: pulsecount_putreg
 *
 * Description:
 *   Read the value of an pulsecount timer register.
 *
 * Input Parameters:
 *   priv - A reference to the pulsecount block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void pulsecount_putreg(struct stm32l4_tim_s *priv, int offset,
                              uint16_t value)
{
  putreg16(value, priv->base + offset);
}

/****************************************************************************
 * Name: pulsecount_modifyreg
 *
 * Description:
 *   Modify timer register (32-bit or 16-bit)
 *
 * Input Parameters:
 *   priv    - A reference to the pulsecount block status
 *   offset  - The offset to the register to read
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void pulsecount_modifyreg(struct stm32l4_tim_s *priv, uint32_t offset,
                                 uint32_t clearbits, uint32_t setbits)
{
  modifyreg16(priv->base + offset, (uint16_t)clearbits,
              (uint16_t)setbits);
}

/****************************************************************************
 * Name: pulsecount_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the pulsecount block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_TIMER_INFO
static void pulsecount_dumpregs(struct pulsecount_lowerhalf_s *dev,
                                const char *msg)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;

  _info("%s:\n", msg);
  _info("  CR1: %04x CR2:  %04x SMCR:  %04x DIER:  %04x\n",
          pulsecount_getreg(priv, STM32_GTIM_CR1_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CR2_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_SMCR_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_DIER_OFFSET));
  _info("   SR: %04x EGR:  %04x CCMR1: %04x CCMR2: %04x\n",
          pulsecount_getreg(priv, STM32_GTIM_SR_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_EGR_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CCMR1_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CCMR2_OFFSET));
  _info(" CCER: %04x CNT:  %04x PSC:   %04x ARR:   %04x\n",
          pulsecount_getreg(priv, STM32_GTIM_CCER_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CNT_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_PSC_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_ARR_OFFSET));
  _info(" CCR1: %04x CCR2: %04x CCR3:  %04x CCR4:  %04x\n",
          pulsecount_getreg(priv, STM32_GTIM_CCR1_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CCR2_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CCR3_OFFSET),
          pulsecount_getreg(priv, STM32_GTIM_CCR4_OFFSET));
  _info("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
          pulsecount_getreg(priv, STM32_ATIM_RCR_OFFSET),
          pulsecount_getreg(priv, STM32_ATIM_BDTR_OFFSET),
          pulsecount_getreg(priv, STM32_ATIM_DCR_OFFSET),
          pulsecount_getreg(priv, STM32_ATIM_DMAR_OFFSET));
}
#endif

/****************************************************************************
 * Name: pulsecount_ccr_update
 ****************************************************************************/

static int pulsecount_ccr_update(struct pulsecount_lowerhalf_s *dev,
                                 uint8_t index, uint32_t ccr)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t offset = 0;

  /* CCR channel indices are one-based to match timer channel numbers. */

  switch (index)
    {
      case 1:
        {
          offset = STM32_GTIM_CCR1_OFFSET;
          break;
        }

      case 2:
        {
          offset = STM32_GTIM_CCR2_OFFSET;
          break;
        }

      case 3:
        {
          offset = STM32_GTIM_CCR3_OFFSET;
          break;
        }

      case 4:
        {
          offset = STM32_GTIM_CCR4_OFFSET;
          break;
        }

      default:
        {
          _err("ERROR: No such CCR: %u\n", index);
          return -EINVAL;
        }
    }

  /* Update CCR register */

  pulsecount_putreg(priv, offset, ccr);

  return OK;
}

/****************************************************************************
 * Name: pulsecount_duty_update
 *
 * Description:
 *   Try to change only channel duty
 *
 * Input Parameters:
 *   dev     - A reference to the lower half driver state structure
 *   channel - Channel to by updated
 *   duty    - New duty
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pulsecount_duty_update(struct pulsecount_lowerhalf_s *dev,
                                  uint8_t channel, ub16_t duty)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t reload = 0;
  uint32_t ccr    = 0;

  /* We don't want compilation warnings if no DEBUGASSERT */

  UNUSED(priv);

  DEBUGASSERT(priv != NULL);

  _info("TIM%u channel: %u duty: %08" PRIx32 "\n",
          priv->timid, channel, duty);

  /* Get the reload values */

  reload = pulsecount_getreg(priv, STM32_GTIM_ARR_OFFSET);

  /* Duty cycle:
   *
   * duty cycle = ccr / reload (fractional value)
   */

  ccr = b16toi(duty * reload + b16HALF);

  _info("ccr: %" PRIu32 "\n", ccr);

  /* Write corresponding CCR register */

  return pulsecount_ccr_update(dev, channel, ccr);
}

/****************************************************************************
 * Name: pulsecount_frequency_update
 *
 * Description:
 *   Update a pulsecount timer frequency
 *
 ****************************************************************************/

static int pulsecount_frequency_update(struct pulsecount_lowerhalf_s *dev,
                                       uint32_t frequency)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t reload    = 0;
  uint32_t timclk    = 0;
  uint32_t prescaler = 0;

  /* Calculate optimal values for the timer prescaler and for the timer
   * reload register. If 'frequency' is the desired frequency, then
   *
   *   reload = timclk / frequency
   *   timclk = pclk / presc
   *
   * Or,
   *
   *   reload = pclk / presc / frequency
   *
   * There are many solutions to this, but the best solution will be the one
   * that has the largest reload value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   0 <= presc  <= 65536
   *   1 <= reload <= 65535
   *
   * So presc = pclk / 65535 / frequency would be optimal.
   *
   * Example:
   *
   *  pclk      = 42 MHz
   *  frequency = 100 Hz
   *
   *  prescaler = 42,000,000 / 65,535 / 100
   *            = 6.4 (or 7 -- taking the ceiling always)
   *  timclk    = 42,000,000 / 7
   *            = 6,000,000
   *  reload    = 6,000,000 / 100
   *            = 60,000
   */

  prescaler = (priv->pclk / frequency + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = priv->pclk / prescaler;

  reload = timclk / frequency;
  if (reload < 2)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }
  else
    {
      reload--;
    }

  _info("TIM%u PCLK: %" PRIu32 " frequency: %" PRIu32 " TIMCLK: %" PRIu32
          " prescaler: %" PRIu32 " reload: %" PRIu32 "\n",
          priv->timid, priv->pclk, frequency, timclk, prescaler, reload);

  /* Set the reload and prescaler values */

  pulsecount_putreg(priv, STM32_GTIM_ARR_OFFSET, reload);
  pulsecount_putreg(priv, STM32_GTIM_PSC_OFFSET,
                     (uint16_t)(prescaler - 1));

  return OK;
}

/****************************************************************************
 * Name: pulsecount_timer_configure
 *
 * Description:
 *   Initial configuration for pulsecount timer
 *
 ****************************************************************************/

static int pulsecount_timer_configure(struct stm32l4_tim_s *priv)
{
  uint16_t cr1 = 0;

