apache/nuttx/arch/arm/src/stm32l4/stm32l4_pulsecount.c
  /* Verify that this is an update interrupt.  Nothing else is expected. */

  regval = pulsecount_getreg(priv, STM32_ATIM_SR_OFFSET);
  DEBUGASSERT((regval & ATIM_SR_UIF) != 0);

  /* Clear the UIF interrupt bit */

  pulsecount_putreg(priv, STM32_ATIM_SR_OFFSET, regval & ~ATIM_SR_UIF);

  /* Calculate the new count by subtracting the number of pulses
   * since the last interrupt.
   */

  if (priv->count <= priv->prev)
    {
      /* We are finished.  Turn off the mast output to stop the output as
       * quickly as possible.
       */

      regval  = pulsecount_getreg(priv, STM32_ATIM_BDTR_OFFSET);
      regval &= ~ATIM_BDTR_MOE;
      pulsecount_putreg(priv, STM32_ATIM_BDTR_OFFSET, regval);

      /* Disable first interrupts, stop and reset the timer */

      pulsecount_ll_stop(dev);

      /* Then perform the callback into the upper half driver */

      pulsecount_expired(priv->handle);

      priv->handle = NULL;
      priv->count  = 0;
      priv->prev   = 0;
      priv->curr   = 0;
    }
  else
    {
      /* Decrement the count of pulses remaining using the number of
       * pulses generated since the last interrupt.
       */

      priv->count -= priv->prev;

      /* Set up the next RCR.  Set 'prev' to the value of the RCR that
       * was loaded when the update occurred (just before this interrupt)
       * and set 'curr' to the current value of the RCR register (which
       * will bet loaded on the next update event).
       */

      priv->prev = priv->curr;
      priv->curr = pulsecount_count(priv->count - priv->prev);
      pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET,
                         (uint16_t)priv->curr - 1);
    }

  /* Now all of the time critical stuff is done so we can do some debug
   * output
   */

  _info("Update interrupt SR: %04" PRIx16 " prev: %u curr: %u"
          " count: %" PRIu32 "\n",
          regval, (unsigned int)priv->prev, (unsigned int)priv->curr,
          priv->count);

  return OK;
}

/****************************************************************************
 * Name: pulsecount_tim1/8interrupt
 *
 * Description:
 *   Handle timer 1 and 8 interrupts.
 *
 * Input Parameters:
 *   Standard NuttX interrupt inputs
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

#ifdef CONFIG_STM32L4_TIM1_PULSECOUNT
static int pulsecount_tim1interrupt(int irq, void *context, void *arg)
{
  return pulsecount_interrupt((struct pulsecount_lowerhalf_s *)
                              &g_pulsecount1dev);
}
#endif /* CONFIG_STM32L4_TIM1_PULSECOUNT */

#ifdef CONFIG_STM32L4_TIM8_PULSECOUNT
static int pulsecount_tim8interrupt(int irq, void *context, void *arg)
{
  return pulsecount_interrupt((struct pulsecount_lowerhalf_s *)
                              &g_pulsecount8dev);
}
#endif /* CONFIG_STM32L4_TIM8_PULSECOUNT */

/****************************************************************************
 * Name: pulsecount_count
 *
 * Description:
 *   Pick an optimal pulse count to program the RCR.
 *
 * Input Parameters:
 *   count - The total count remaining
 *
 * Returned Value:
 *   The recommended pulse count
 *
 ****************************************************************************/

static uint8_t pulsecount_count(uint32_t count)
{
  /* The the remaining pulse count is less than or equal to the maximum, the
   * just return the count.
   */

  if (count <= ATIM_RCR_REP_MAX)
    {
      return (uint8_t)count;
    }

  /* Otherwise, we have to be careful.  We do not want a small number of
   * counts at the end because we might have trouble responding fast enough.
   * If the remaining count is less than 150% of the maximum, then return
   * half of the maximum.  In this case the final sequence will be between 64
   * and 128.
   */

  else if (count < (3 * ATIM_RCR_REP_MAX / 2))
    {
      return (uint8_t)((ATIM_RCR_REP_MAX + 1) >> 1);
    }

  /* Otherwise, return the maximum.  The final count will be 64 or more */

  else
    {
      return (uint8_t)ATIM_RCR_REP_MAX;
    }
}

/****************************************************************************
 * Name: pulsecount_setapbclock
 *
 * Description:
 *   Enable or disable APB clock for the timer peripheral
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 ****************************************************************************/

static int pulsecount_setapbclock(struct stm32l4_tim_s *priv,
                                  bool on)
{
  uint32_t en_bit;
  uint32_t regaddr;
  int      ret     = OK;

  /* Determine which timer to configure */

  switch (priv->timid)
    {
#ifdef CONFIG_STM32L4_TIM1_PULSECOUNT
          case 1:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM1EN;
              break;
            }
#endif

#ifdef CONFIG_STM32L4_TIM8_PULSECOUNT
          case 8:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM8EN;
              break;
            }
#endif

          default:
          {
            _err("ERROR: No such timer configured %d\n", priv->timid);
            ret = -EINVAL;
            goto errout;
          }
    }

  /* Enable/disable APB 1/2 clock for timer */

  if (on)
    {
      modifyreg32(regaddr, 0, en_bit);
    }
  else
    {
      modifyreg32(regaddr, en_bit, 0);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: pulsecount_ll_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   APB1 or 2 clocking for the GPIOs has already been configured by the RCC
 *   logic at power up.
 *
 ****************************************************************************/

