apache/nuttx/arch/arm/src/stm32l4/stm32l4_pulsecount.c
static int pulsecount_ll_setup(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t pincfg;

  _info("TIM%u\n", priv->timid);

  /* Enable APB1/2 clocking for timer. */

  pulsecount_setapbclock(priv, true);

  pulsecount_dumpregs(dev, "Initially");

  /* Configure the pulsecount output pins, but do not start the timer yet */

  if (priv->channel.out1.in_use == 1)
    {
      pincfg = priv->channel.out1.pincfg;
      _info("pincfg: %08" PRIx32 "\n", pincfg);

      stm32l4_configgpio(pincfg);
      pulsecount_dumpgpio(pincfg, "pulsecount setup");
    }

  return OK;
}

/****************************************************************************
 * Name: pulsecount_ll_shutdown
 *
 * Description:
 *   This method is called when the driver is closed.  The lower half driver
 *   stop pulsed output, free any resources, disable the timer hardware, and
 *   put the system into the lowest possible power usage state
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pulsecount_ll_shutdown(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t pincfg = 0;
  int      ret    = OK;

  _info("TIM%u\n", priv->timid);

  /* Make sure that the output has been stopped */

  pulsecount_ll_stop(dev);

  /* Disable APB1/2 clocking for timer. */

  ret = pulsecount_setapbclock(priv, false);
  if (ret < 0)
    {
      goto errout;
    }

  /* Then put the GPIO pins back to the default state */

  pincfg = priv->channel.out1.pincfg;
  if (pincfg != 0)
    {
      _info("pincfg: %08" PRIx32 "\n", pincfg);

      pincfg &= (GPIO_PORT_MASK | GPIO_PIN_MASK);
      pincfg |= GPIO_INPUT | GPIO_FLOAT;

      stm32l4_configgpio(pincfg);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: pulsecount_ll_stop
 *
 * Description:
 *   Stop the pulsed output and reset the timer resources
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   This function is called to stop the pulsed output at anytime.  This
 *   method is also called from the timer interrupt handler when a repetition
 *   count expires... automatically stopping the timer.
 *
 ****************************************************************************/

static int pulsecount_ll_stop(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;
  uint32_t resetbit = 0;
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  _info("TIM%u\n", priv->timid);

  /* Determine which timer to reset */

  switch (priv->timid)
    {
#ifdef CONFIG_STM32L4_TIM1_PULSECOUNT
          case 1:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM1RST;
            break;
#endif
#ifdef CONFIG_STM32L4_TIM8_PULSECOUNT
          case 8:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM8RST;
            break;
#endif
          default:
            return -EINVAL;
    }

  /* Disable interrupts momentary to stop any ongoing timer processing and
   * to prevent any concurrent access to the reset register.
   */

  flags = enter_critical_section();

  /* Disable further interrupts and stop the timer */

  pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  /* Reset the timer - stopping the output and putting the timer back
   * into a state where pulsecount_start() can be called.
   */

  regval  = getreg32(regaddr);
  regval |= resetbit;
  putreg32(regval, regaddr);

  regval &= ~resetbit;
  putreg32(regval, regaddr);
  leave_critical_section(flags);

  _info("regaddr: %08" PRIx32 " resetbit: %08" PRIx32 "\n",
          regaddr, resetbit);
  pulsecount_dumpregs(dev, "After stop");
  return OK;
}

/****************************************************************************
 * Name: pulsecount_ll_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pulsecount_ll_ioctl(struct pulsecount_lowerhalf_s *dev, int cmd,
                               unsigned long arg)
{
#ifdef CONFIG_DEBUG_TIMER_INFO
  struct stm32l4_tim_s *priv = (struct stm32l4_tim_s *)dev;

  /* There are no platform-specific ioctl commands */

  _info("TIM%u\n", priv->timid);
#endif
  return -ENOTTY;
}

static int pulsecount_setup(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_pulsecount_s *pulse = (struct stm32l4_pulsecount_s *)dev;
  int ret;

  ret = pulsecount_ll_setup((struct pulsecount_lowerhalf_s *)pulse->timer);
  if (ret < 0)
    {
      return ret;
    }

  return pulsecount_configure((struct pulsecount_lowerhalf_s *)pulse->timer);
}

static int pulsecount_shutdown(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_pulsecount_s *pulse = (struct stm32l4_pulsecount_s *)dev;
  return pulsecount_ll_shutdown((struct pulsecount_lowerhalf_s *)
                                pulse->timer);
}

static int pulsecount_start(struct pulsecount_lowerhalf_s *dev,
                            const struct pulsecount_info_s *info,
                            void *handle)
{
  struct stm32l4_pulsecount_s *pulse = (struct stm32l4_pulsecount_s *)dev;
  struct stm32l4_tim_s *priv = pulse->timer;

  if (info->count > 0)
    {
      if (priv->timtype != TIMTYPE_ADVANCED)
        {
          _err("ERROR: TIM%u cannot support pulse count: %" PRIu32 "\n",
                 priv->timid, info->count);
          return -EPERM;
        }
    }

  priv->handle = handle;
  return pulsecount_timer((struct pulsecount_lowerhalf_s *)priv, info);
}

static int pulsecount_stop(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32l4_pulsecount_s *pulse = (struct stm32l4_pulsecount_s *)dev;
  return pulsecount_ll_stop((struct pulsecount_lowerhalf_s *)pulse->timer);
}

static int pulsecount_ioctl(struct pulsecount_lowerhalf_s *dev,
                            int cmd, unsigned long arg)
{
  struct stm32l4_pulsecount_s *pulse = (struct stm32l4_pulsecount_s *)dev;
  return pulsecount_ll_ioctl((struct pulsecount_lowerhalf_s *)pulse->timer,
                             cmd, arg);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

struct pulsecount_lowerhalf_s *stm32l4_pulsecountinitialize(int timer)
{
  struct stm32l4_pulsecount_s *lower = NULL;

  _info("TIM%u\n", timer);

  switch (timer)
    {
#ifdef CONFIG_STM32L4_TIM1_PULSECOUNT
      case 1:
        {
          lower = &g_pulsecount1lower;
          irq_attach(lower->timer->irq, pulsecount_tim1interrupt, NULL);
          up_disable_irq(lower->timer->irq);
          break;
        }
#endif

#ifdef CONFIG_STM32L4_TIM8_PULSECOUNT
      case 8:
        {
          lower = &g_pulsecount8lower;
          irq_attach(lower->timer->irq, pulsecount_tim8interrupt, NULL);
          up_disable_irq(lower->timer->irq);
          break;
        }
#endif

      default:
        {
          _err("ERROR: TIM%d does not support pulse count\n", timer);
          return NULL;
        }
    }

  return (struct pulsecount_lowerhalf_s *)lower;
}

#endif /* CONFIG_STM32L4_TIM1_PULSECOUNT || CONFIG_STM32L4_TIM8_PULSECOUNT */
